Autodesk.Revit.DB.TextElement.IsTextWrappingActive
A flag identifying whether text-wrapping is currently active in this text element or not.
Remarks:
This is currently a read-only property and its value is set when the text element
is created. If the element was created with a specified width or if an explicit width
was set later, the wrapping would be automatically set as active. It means that any text
line that is longer that the current width of the text-box will automatically wrapped
onto the next line.
Since:
2016

Autodesk.Revit.DB.TextElement.VerticalAlignment
Vertical alignment of the text content within the text area of the element.
Remarks:
This is a read-only property. In all but a very few cases the value
of vertical text alignment is only set to be VerticalTextAlignment.Top.
Since:
2016